{
        "anytime" : [
                 "What do you call a dinosaur that is sleeping? Answer: A dino-snore!",
 "What is brown, hairy and wears sunglasses? Answer: A coconut on vacation",
 "What did one toilet say to the other? Answer: You look flushed",
 "Why did the man put his money in the freezer? Answer: He wanted cold hard cash!",
 "Why couldn't the astronaut book a hotel on the moon? Answer: Because it was full",
 "How do pickles enjoy a day out? Answer: They relish it",
 "What do you call an old snowman? Answer: Water ",
 "What's a pirate's favorite letter? Answer: Arrrrrrrrrr",
 "What do you get when you cross an elephant with a fish? Answer: Swimming trunks", 
 "How do you throw a party in space? Answer: You planet ",
 "What did zero say to eight?  Answer: Nice belt! ",
 "What happened when the skunk was on trial? Answer: The judge declared, 'Odor in the court, odor in the court!' ",
 "Two pickles fell out of a jar onto the floor What did one say to the other? Answer: Dill with it",
 "What do you call a sleeping bull? Answer: A bulldozer! ",
 "Why did the tomato blush?  Answer: It saw the salad dressing ",
 "What do you call a fish without an eye?  Answer: A fsh ",
 "What's the difference between roast beef and pea soup? Answer: Anyone can roast beef ",
 "What do you get when you cross a centipede with a parrot? Answer: A walkie talkie ",
 "Why are robots never afraid? Answer: They have nerves of steel",
 "Why did the cabbage win the race?  Answer: Because it was a-head ",
 "What does an evil hen lay? Answer: Deviled eggs ",
 "What does a book do in the winter? Answer: Puts on a jacket ",
 "What did the Dalmatian say after lunch? Answer: That hit the spot!",
 "What sound do you hear when a cow breaks the sound barrier? Answer: Cowboom! ",
 "What kind of haircuts to bees get? Answer: Buzzzzzcuts ",
 "What do you get if you cross a pie and a snake?  Answer: A pie-thon ",
 "What do you do if you get peanut butter on your doorknob? Answer: Use a door jam",
 "Why was  so mad at ? Answer: Because   ",
 "Why didn't the robot finish his breakfast? Answer: Because the orange juice told him to concentrate ",
 "Why can't you play hockey with pigs Answer: They always hog the puck",
 "Why do porcupines always win the game? Answer: They have the most points",
 "Why did the kid cross the playground? Answer: To get to the other slide",
 "Where do elephants pack their clothes? Answer: In their trunks! ",
 "What does bread do on vacation? Answer: Loaf around ",
 "Why was the broom running late? Answer: It over-swept",
 "What part of the fish weighs the most?  Answer: The scales ",
 "What do ghosts like to eat in the summer? Answer: I Scream",
 "Why did the teacher wear sunglasses to school? Answer: Because her students were so bright ",
 "What do you call a deer with pink eye? Answer: A colorful eye-deer (credit to Capt John of the Appledore!) ",
 "Where do sheep go on vacation? Answer: The Baaa-hamas ",
 "What does every birthday end with? Answer: The letter Y ",
 "What did the paper say to the pencil? Answer: Write on! ",
 "How does a vampire start a letter? Answer: Tomb it may concern",
 "Why do birds fly? Answer: It's faster than walking ",
 "Why did Superman flush the toilet? Answer: Because it was his doody ",
 "Why did the pillow cross the road? Answer: It was picking up the chicken's feathers ",
 "Can February March? Answer: No, but April May ",
 "What time do ducks wake up? Answer: At the quack of dawn ",
 "Why did the giraffes get bad grades? Answer: She had her head in the clouds ",
 "What did the flower say after it told a joke? Answer: I was just pollen your leg ",
 "What did the traffic light say to the truck? Answer: Don't look, I'm changing ",
 "What does a cloud wear? Answer: Thunderwear! ",
 "Why didn't the koala bear get the job? Answer: They said she was over-koala-fied",
 "What do you call a droid that takes the long way around? Answer: R detour",
 "Who was that owl who did all the tricks? Answer: Who-dini",
 "What kind of vegetable is angry? Answer: A steamed carrot! ",
 "How does the moon stay up in the sky? Answer: Moonbeams! ",
 "Why isn't there a clock in the library? Answer: Because it tocks too much ",
 "Why do you never see elephants hiding in trees? Answer: Because they're so good at it! ",
 "What day of the week are most twins born on? Answer: Twos-day! ",
 "How do you stop an astronaut’s baby from crying? Answer: You rocket!",
 "Why was  afraid of ? Answer: Because , , ",
 "What is a witch’s favorite subject in school? Answer: Spelling!",
 "When does a joke become a “dad” joke? Answer: When the punchline is a parent",
 "What is fast, loud and crunchy? Answer: A rocket chip!",
 "How do you make a lemon drop? Answer: Just let it fall",
 "What did the limestone say to the geologist? Answer: Don’t take me for granite!",
 "What do you call a duck that gets all A’s? Answer: A wise quacker",
 "Why does a seagull fly over the sea? Answer: Because if it flew over the bay, it would be a baygull",
 "What kind of water cannot freeze? Answer: Hot water",
 "What kind of tree fits in your hand? Answer: A palm tree!",
 "Why did the cookie go to the hospital? Answer: Because he felt crummy",
 "Why was the baby strawberry crying? Answer: Because her mom and dad were in a jam",
 "What did the little corn say to the mama corn? Answer: Where is pop corn?",
 "What is worse than raining cats and dogs? Answer: Hailing taxis!",
 "Why did the teddy bear say no to dessert? Answer: Because she was stuffed",
 "How much does it cost a pirate to get his ears pierced? Answer: About a buck an ear",
 "Where would you find an elephant? Answer: The same place you lost her!",
 "How do you talk to a giant? Answer: Use big words!",
 "What animal is always at a baseball game? Answer: A bat",
 "What falls in winter but never gets hurt? Answer: Snow!",
 "What do you call a ghost’s true love? Answer: His ghoul-friend",
 "What building in New York has the most stories? Answer: The public library!",
 "What did one volcano say to the other? Answer: I lava you!",
 "How do we know that the ocean is friendly? Answer: It waves!",
 "What is a tornado’s favorite game to play? Answer: Twister!",
 "What has ears but cannot hear? Answer: A cornfield",
 "How does the moon cut his hair? Answer: Eclipse it",
 "How do you get a squirrel to like you? Answer: Act like a nut!",
 "What do you call two birds in love? Answer: Tweethearts!",
 "How does a scientist freshen her breath? Answer: With experi-mints!",
 "How are false teeth like stars? Answer: They come out at night!",
 "How can you tell a vampire has a cold? Answer: She starts coffin",
 "What’s worse than finding a worm in your apple? Answer: Finding half a worm",
 "What is a computer's favorite snack? Answer: Computer chips!!",
 "Why don’t elephants chew gum? Answer: They do, just not in public",
 "What was the first animal in space? Answer: The cow that jumped over the moon",
 "What did the left eye say to the right eye? Answer: Between us, something smells!",
 "What did the banana say to the dog? Answer: Nothing Bananas can’t talk",
 "What time is it when the clock strikes ? Answer: Time to get a new clock",
 "How does a cucumber become a pickle? Answer: It goes through a jarring experience",
 "What do you call a boomerang that won’t come back? Answer: A stick",
 "What do you think of that new diner on the moon? Answer: Food was good, but there really wasn’t much atmosphere",
 "Why did the dinosaur cross the road? Answer: Because the chicken wasn’t born yet",
 "Why can’t Elsa have a balloon? Answer: Because she will let it go",
 "How do you make an octopus laugh? Answer: With ten-tickles!",
 "How do you make a tissue dance? Answer: You put a little boogie in it",
 "What's green and can fly? Answer: Super Pickle!",
 "What do you get when you cross a vampire and a snowman? Answer: Frost bite!",
 "Knock knock Who’s there?  Answer: Interrupting pir—yarrrrrr!",
 "What did the nose say to the finger? Answer: Quit picking on me!",
 "What musical instrument is found in the bathroom? Answer: A tuba toothpaste",
 "Why did the kid bring a ladder to school? Answer: Because she wanted to go to high school",
 "What is a vampire's favorite fruit? Answer: A blood orange",
 "What do elves learn in school? Answer: The elf-abet",
 "What do you call a dog magician? Answer: A labracadabrador",
 "Where do pencils go on vacation? Answer: Pencil-vania",
 "Why couldn't the pony sing a lullaby? Answer: She was a little hoarse",
 "Why didn’t the skeleton go to the dance? Answer: He had no body to dance with",
 "What did one plate say to the other plate? Answer: Dinner is on me!",
 "What gets wetter the more it dries? Answer: A towel",
 "What do you call two bananas? Answer: Slippers",
 "Why did the banana go to the doctor? Answer: Because it wasn’t peeling well",
 "What do you call a fake noodle? Answer: An impasta",
 "What stays in the corner yet can travel all over the world?   Answer: A stamp",
 "How do you fix a cracked pumpkin? Answer: With a pumpkin patch",
 "What kind of award did the dentist receive? Answer: A little plaque",
 "What do you call a funny mountain? Answer: Hill-arious",
 "Why are ghosts bad liars? Answer: Because you can see right through them",
 "Why do bees have sticky hair? Answer: Because they use a honeycomb",
 "Why did the student eat his homework? Answer: Because the teacher told him it was a piece of cake!",
 "What did the big flower say to the little flower? Answer: Hi, bud!",
 "When you look for something, why is it always in the last place you look? Answer: Because when you find it, you stop looking",
 "What part of your body can cause the end of the world? Answer: Your apoco-lips (AJ, age !)",
 "What did the astronaut say when he crashed into the moon? Answer: 'I Apollo-gize'",
 "Why didn’t the orange win the race? Answer: It ran out of juice",
 "What dinosaur had the best vocabulary?   Answer: The thesaurus",
 "What did one DNA strand say to the other DNA strand? Answer: Do these genes make my butt look big?",
 "Why aren’t dogs good dancers? Answer: They have two left feet",
 "What did the wolf say when it stubbed its toe? Answer: Owwwww-ch! (by Henrik, age )",
 "Kid: What are you doing under there? Mom: Under where? Answer: Kid: Ha ha! You said underwear!!",
 "Why did Johnny throw the clock out of the window? Answer: Because he wanted to see time fly"
        ]
}
